Download and import the Data Science Job Salary dataset.

In [1]:
import pandas as pd

data = pd.read_csv('datascience_salaries.csv')
data.head()

,Unnamed: 0,job_title,job_type,experience_level,location,salary_currency,salary
0,0,Data scientist,Full Time,Senior,New York City,USD,149000
1,2,Data scientist,Full Time,Senior,Boston,USD,120000
2,3,Data scientist,Full Time,Senior,London,USD,68000
3,4,Data scientist,Full Time,Senior,Boston,USD,120000
4,5,Data scientist,Full Time,Senior,New York City,USD,149000

In [2]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1171 entries, 0 to 1170
Data columns (total 7 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Unnamed: 0        1171 non-null   int64
 1   job_title         1171 non-null   object
 2   job_type          1171 non-null   object
 3   experience_level  1171 non-null   object
 4   location          1171 non-null   object
 5   salary_currency   1171 non-null   object
 6   salary            1171 non-null   int64
dtypes: int64(2), object(5)
memory usage: 64.2+ KB

Normalize the ‘salary’ column using Min-Max normalization which scales all salary values between 0 and 1.

In [5]:
from sklearn.preprocessing import MinMaxScaler

scaler = MinMaxScaler()

data['normalized_salary'] = scaler.fit_transform(data[['salary']]).round(3)

data.head()

,Unnamed: 0,job_title,job_type,experience_level,location,salary_currency,salary,normalized_salary
0,0,Data scientist,Full Time,Senior,New York City,USD,149000,0.601
1,2,Data scientist,Full Time,Senior,Boston,USD,120000,0.455
2,3,Data scientist,Full Time,Senior,London,USD,68000,0.192
3,4,Data scientist,Full Time,Senior,Boston,USD,120000,0.455
4,5,Data scientist,Full Time,Senior,New York City,USD,149000,0.601

Implement dimensionality reduction like Principal Component Analysis (PCA) or t-SNE to reduce the number of features (columns) in the dataset.

In [6]:
from sklearn.decomposition import PCA

pca = PCA(n_components=2)

data_encoded = data.copy()

# Corrected select_dtypes syntax
pca_components = pca.fit_transform(data_encoded.select_dtypes(include=['float64', 'int64']))

# Assign PCA components
data_encoded['PCA1'] = pca_components[:, 0]
data_encoded['PCA2'] = pca_components[:, 1]

data_encoded.head()

,Unnamed: 0,job_title,job_type,experience_level,location,salary_currency,salary,normalized_salary,PCA1,PCA2
0,0,Data scientist,Full Time,Senior,New York City,USD,149000,0.601,84163.766081,-949.193183
1,2,Data scientist,Full Time,Senior,Boston,USD,120000,0.455,55163.767131,-941.138351
2,3,Data scientist,Full Time,Senior,London,USD,68000,0.192,3163.768472,-929.281412
3,4,Data scientist,Full Time,Senior,Boston,USD,120000,0.455,55163.767548,-939.138352
4,5,Data scientist,Full Time,Senior,New York City,USD,149000,0.601,84163.767125,-944.193183

Group the dataset by the ‘experience_level’ column and calculate the average and median salary for each experience level (e.g., Junior, Mid-level, Senior)

In [9]:
groupped_salary = data_encoded.groupby('experience_level')['normalized_salary'].agg(['mean', 'median'])

# Corrected rename syntax
groupped_salary = groupped_salary.rename(columns={'mean': "mean salary", 'median': 'median salary'})

print(groupped_salary)

                  mean salary  median salary
experience_level
Entry                0.030770          0.000
Executive            0.232923          0.081
Mid                  0.110174          0.106
Senior               0.227846          0.192